Revit 2027 API
ExternalResourceLoadContext Methods
The ExternalResourceLoadContext type exposes the following members.
Methods
Name | Description
CallingDocumentHasModelPath |  Indicates whether the document requesting the external resource has a defined ModelPath.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCallingDocumentModelPath |  Returns a copy of the ModelPath of the document that is requesting the external resource.
GetCurrentlyLoadedReference |  Returns a copy of the ExternalResourceReference currently in use by the containing element.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExternalResourceLoadContext Class
Autodesk.Revit.DB Namespace